projects/score366rails/app/controllers/createtables_controller.rb

UPDATE "users" SET "encrypted_password" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["encrypted_password", "$2a$10$vBq.9kI1VKwiKn05bTymauzAV99z.aB7LdSeOYMiIGKsWFSMg2sky"], ["updated_at", "2016-04-22 22:09:25.572364"], ["id", 1]]
INSERT INTO "users" ("email", "encrypted_password", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"
---
  def createtables
    @user = User.update(1, :password => 'password', :password_confirmation => 'password')
      @user.save!